# PassesFilter Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ElementFilter..::..PassesFilter Method
ElementFilter Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| PassesFilter(Element) | Applies the filter to a given element. |
| PassesFilter(Document, ElementId) | Applies the filter to a given element. |

# See Also
ElementFilter Class
ElementFilter Members
Autodesk.Revit.DB Namespace